УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_ПотенциальныеКлиенты/CRM_ПотенциальныеКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПотенциальныеКлиенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор в системе идентификации по лицу</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonForms/CRM_ФормаВыбораРеквизита/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивИдентификаторовОбъектов = Новый Массив;
	Если Не Параметры.Свойство("ИдентификаторМетаданных", ИдентификаторОбъекта) 
		И НЕ Параметры.Свойство("ИдентификаторыМетаданных", МассивИдентификаторовОбъектов) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Параметры.Свойство("ВключатьДопРеквизиты", ВключатьДопРеквизиты);
	ВключатьДопРеквизиты = ВключатьДопРеквизиты И ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	Параметры.Свойство("ВключатьКИ", ВключатьКИ);
	Если НЕ Параметры.Свойство("Уровней", Уровней) Тогда
		Уровней = 3;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторОбъекта) И МассивИдентификаторовОбъектов.Количество()>0 Тогда
		ИдентификаторОбъекта = МассивИдентификаторовОбъектов[0];
	КонецЕсли;
	Если МассивИдентификаторовОбъектов.Количество()>1 Тогда
		Элементы.ИдентификаторОбъекта.Видимость = Истина;
		Элементы.ИдентификаторОбъекта.СписокВыбора.ЗагрузитьЗначения(МассивИдентификаторовОбъектов);
	КонецЕсли;
	
	СтандартныеРеквизиты = "Код, Наименование, Владелец, Родитель, Номер, Дата";
	
	МДИсточника = ИдентификаторОбъекта.ЗначениеПустойСсылки.Метаданные();
	ЭтоТЧ = Параметры.Свойство("ИмяТЧ");
	Если ЭтоТЧ Тогда
		МДИсточника = МДИсточника.ТабличныеЧасти.Найти(Параметры.ИмяТЧ);
		Если МДИсточника = Неопределено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоРеквизитов");
	СформироватьДеревоРеквизитов(Дерево, МДИсточника,, ЭтоТЧ);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРеквизитов");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыбор(ВыбраннаяСтрока);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ОбработатьВыбор(Элементы.ДеревоРеквизитов.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДеревоРеквизитов(Дерево, МетаданныеОбъекта, ТекУровень = 1, ЭтоТЧ = Ложь)
	
	Если ТекУровень>Уровней Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Реквизит из МетаданныеОбъекта.Реквизиты Цикл
		Типы = Реквизит.Тип.Типы();
		Если СтрНайти(НРег(Реквизит.Имя), "удалить") = 1 ИЛИ Типы[0] = Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрРеквизит = Дерево.Строки.Добавить();
		НовСтрРеквизит.Реквизит = Реквизит.Имя;
		НовСтрРеквизит.Представление = Строка(Реквизит);
		
		Если Типы.Количество() = 1 И ОбщегоНазначения.ЭтоСсылка(Типы[0]) 
			И (ОбщегоНазначения.ЭтоДокумент(Метаданные.НайтиПоТипу(Типы[0])) ИЛИ ОбщегоНазначения.ЭтоСправочник(Метаданные.НайтиПоТипу(Типы[0]))) Тогда
			СформироватьДеревоРеквизитов(НовСтрРеквизит, Метаданные.НайтиПоТипу(Типы[0]), ТекУровень+1);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Реквизит из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если СтрНайти(СтандартныеРеквизиты, Реквизит.Имя) > 0 Тогда
			НовСтрРеквизит = Дерево.Строки.Добавить();
			НовСтрРеквизит.Реквизит = Реквизит.Имя;
			НовСтрРеквизит.Представление = Реквизит.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЭтоТЧ Тогда
		Если ВключатьДопРеквизиты И МетаданныеОбъекта.ТабличныеЧасти.Найти("ДополнительныеРеквизиты")<>Неопределено Тогда
			ДополнитьДеревоРеквизитовДополнительнымиРеквизитами(МетаданныеОбъекта, Дерево, ТекУровень);
		КонецЕсли;
		
		Если ВключатьКИ И МетаданныеОбъекта.ТабличныеЧасти.Найти("КонтактнаяИнформация")<>Неопределено Тогда
			ДополнитьДеревоРеквизитовКонтактнойИнформацией(МетаданныеОбъекта, Дерево);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДеревоРеквизитовКонтактнойИнформацией(МетаданныеОбъекта, НовСтрОбъект)
	МассивВидов = Новый Массив;
	Если МетаданныеОбъекта = Метаданные.Справочники.Партнеры Тогда
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникПартнеры);
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыКомпания);
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо);
	ИначеЕсли МетаданныеОбъекта = Метаданные.Справочники.CRM_ПотенциальныеКлиенты Тогда
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникCRM_ПотенциальныеКлиенты);
	ИначеЕсли МетаданныеОбъекта = Метаданные.Справочники.КонтактныеЛицаПартнеров Тогда
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров);
	ИначеЕсли МетаданныеОбъекта = Метаданные.Справочники.Организации Тогда
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникОрганизации);
	ИначеЕсли МетаданныеОбъекта = Метаданные.Справочники.ФизическиеЛица Тогда
		МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица);
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	                      |	ВидыКонтактнойИнформации.Тип КАК Тип,
	                      |	ВидыКонтактнойИнформации.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	                      |ГДЕ
	                      |	ВидыКонтактнойИнформации.Родитель В(&Родитель)");
	Запрос.УстановитьПараметр("Родитель", МассивВидов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрРеквизит = НовСтрОбъект.Строки.Добавить();
		НовСтрРеквизит.Реквизит = Выборка.Ссылка;
		НовСтрРеквизит.Представление = Выборка.Наименование;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьДеревоРеквизитовДополнительнымиРеквизитами(МетаданныеОбъекта, НовСтрОбъект, ТекУровень)
	
	НаборСвойствОбъекта = Новый СписокЗначений;
	Если МетаданныеОбъекта = Метаданные.Справочники.Партнеры Тогда
		Объект = Справочники.Партнеры.СоздатьЭлемент();
		НаборСвойствОбъекта.ЗагрузитьЗначения(УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(Объект).ВыгрузитьКолонку("Набор"));
	ИначеЕсли МетаданныеОбъекта = Метаданные.Справочники.КонтактныеЛицаПартнеров Тогда
		НаборСвойствОбъекта.ЗагрузитьЗначения(УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка()).ВыгрузитьКолонку("Набор"));
	ИначеЕсли МетаданныеОбъекта = Метаданные.Справочники.CRM_ПотенциальныеКлиенты Тогда
		НаборСвойствОбъекта.ЗагрузитьЗначения(УправлениеСвойствамиСлужебный.ПолучитьНаборыСвойствОбъекта(Справочники.CRM_ПотенциальныеКлиенты.ПустаяСсылка()).ВыгрузитьКолонку("Набор"));
	КонецЕсли;

	Если НаборСвойствОбъекта.Количество() > 0 Тогда
		ДополнительныеСвойстваОбъекта = Новый ТаблицаЗначений;
		ДополнительныеСвойстваОбъекта.Колонки.Добавить("Свойство");
		ТаблицаДополнительныхРеквизитов = УправлениеСвойствамиСлужебный.ЗначенияСвойств(ДополнительныеСвойстваОбъекта, НаборСвойствОбъекта, Ложь);
			
		Для Каждого СтрокаТЗ Из ТаблицаДополнительныхРеквизитов Цикл
			
			НовСтрРеквизит = НовСтрОбъект.Строки.Добавить();
			НовСтрРеквизит.Реквизит = СтрокаТЗ.Свойство;
			НовСтрРеквизит.Представление = СтрокаТЗ.Наименование;
			
			Типы = СтрокаТЗ.ТипЗначения.Типы();
			Если Типы.Количество() = 1  И ОбщегоНазначения.ЭтоСсылка(Типы[0])
				И (ОбщегоНазначения.ЭтоДокумент(Метаданные.НайтиПоТипу(Типы[0])) ИЛИ ОбщегоНазначения.ЭтоСправочник(Метаданные.НайтиПоТипу(Типы[0]))) 
				И Типы[0] <> Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
				 
				СформироватьДеревоРеквизитов(НовСтрРеквизит, Метаданные.НайтиПоТипу(Типы[0]), ТекУровень+1);
				 
			КонецЕсли;
			 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор(Строка)
	
	СтруктураРеквизита = СтруктураРеквизита(Строка);
	Закрыть(СтруктураРеквизита);
	
КонецПроцедуры

&НаСервере
Функция СтруктураРеквизита(Строка)
	
	СтруктураРеквизита = Новый Структура;
	СтрокаДерева = ДеревоРеквизитов.НайтиПоИдентификатору(Строка);
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(СтрокаДерева.Реквизит);
	Представление = СтрокаДерева.Представление;
	
	Пока СтрокаДерева.ПолучитьРодителя()<>Неопределено Цикл
		СтрокаДерева = СтрокаДерева.ПолучитьРодителя();
		МассивРеквизитов.Вставить(0, СтрокаДерева.Реквизит);
		Представление = СтрокаДерева.Представление + "." + Представление;
	КонецЦикла;
	
	СтруктураРеквизита.Вставить("Реквизиты", МассивРеквизитов);
	СтруктураРеквизита.Вставить("Представление", Представление);
	СтруктураРеквизита.Вставить("ИдентификаторМетаданных", ИдентификаторОбъекта);
	
	Возврат СтруктураРеквизита;
	
КонецФункции

&НаСервере
Процедура ИдентификаторОбъектаПриИзмененииНаСервере()
	МДИсточника = ИдентификаторОбъекта.ЗначениеПустойСсылки.Метаданные();
	Дерево = РеквизитФормыВЗначение("ДеревоРеквизитов");
	Дерево.Строки.Очистить();
	СформироватьДеревоРеквизитов(Дерево, МДИсточника,, ЭтоТЧ);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРеквизитов");
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОбъектаПриИзменении(Элемент)
	ИдентификаторОбъектаПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти
